In [1]:
import pandas
pandas.__version__

'1.0.5'

In [2]:
import numpy as np
import pandas as pd

In [3]:
counts = pd.Series([632,1638,569,115])
counts

0     632
1    1638
2     569
3     115
dtype: int64

In [4]:
counts.values

array([ 632, 1638,  569,  115], dtype=int64)

In [5]:
counts.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
PAS = pd.Series([32,23,"a","p",23])
PAS

0    32
1    23
2     a
3     p
4    23
dtype: object

In [7]:
counts.values

array([ 632, 1638,  569,  115], dtype=int64)

In [8]:
counts.index

RangeIndex(start=0, stop=4, step=1)

In [9]:
Prathik=pd.Series([12,21,3,4,5,443,23],
                  index=['a','b','c','d','e','f','g'])
Prathik

a     12
b     21
c      3
d      4
e      5
f    443
g     23
dtype: int64

In [10]:
Prathik['c']

3

In [11]:
Prathik[0]

12

In [12]:
bacteria=pd.Series([632, 1638, 569, 115],
                   index=['Firmicutes', 'Proteobacteria', 'Actinobacteria', 'Bacteroidetes'])

bacteria

Firmicutes         632
Proteobacteria    1638
Actinobacteria     569
Bacteroidetes      115
dtype: int64

In [13]:
bacteria['Actinobacteria']

569

In [14]:
bacteria[0]

632

In [15]:
bacteria.name ='Counts'
bacteria.index.name ='Phylum'
bacteria

Phylum
Firmicutes         632
Proteobacteria    1638
Actinobacteria     569
Bacteroidetes      115
Name: Counts, dtype: int64

In [16]:
np.log(bacteria)

Phylum
Firmicutes        6.448889
Proteobacteria    7.401231
Actinobacteria    6.343880
Bacteroidetes     4.744932
Name: Counts, dtype: float64

In [17]:
bacteria[bacteria>1000]

Phylum
Proteobacteria    1638
Name: Counts, dtype: int64

In [18]:
bacteria[bacteria>500]

Phylum
Firmicutes         632
Proteobacteria    1638
Actinobacteria     569
Name: Counts, dtype: int64

In [19]:
bacteria[bacteria<800]

Phylum
Firmicutes        632
Actinobacteria    569
Bacteroidetes     115
Name: Counts, dtype: int64

In [20]:
Prathik[Prathik<10]

c    3
d    4
e    5
dtype: int64

In [21]:
bacteria_dict = {'Firmicutes': 632, 'Proteobacteria': 1500, 'Actinobacteria': 569, 'Bacteroidetes': 115}
print(bacteria_dict)
pd.Series(bacteria_dict)

{'Firmicutes': 632, 'Proteobacteria': 1500, 'Actinobacteria': 569, 'Bacteroidetes': 115}

Firmicutes         632
Proteobacteria    1500
Actinobacteria     569
Bacteroidetes      115
dtype: int64

In [22]:
Price={'Apple':90, 'Orange':50,'Banana':30,'Lemon':10}
print(Price)
pd.Series(Price)

{'Apple': 90, 'Orange': 50, 'Banana': 30, 'Lemon': 10}

Apple     90
Orange    50
Banana    30
Lemon     10
dtype: int64

In [23]:
Prathik[Prathik<20]

a    12
c     3
d     4
e     5
dtype: int64

In [24]:
data = {"Province": ["FL", "FL", "NH", "NH", "ZH"],
        "Year": [2013, 2014, 2013, 2014, 2014],
        "Literacy": [0.2, 0.1, 0.5, 0.3, 0.5]}
print(data)
data = pd.DataFrame(data)
data

{'Province': ['FL', 'FL', 'NH', 'NH', 'ZH'], 'Year': [2013, 2014, 2013, 2014, 2014], 'Literacy': [0.2, 0.1, 0.5, 0.3, 0.5]}

  Province  Year  Literacy
0       FL  2013       0.2
1       FL  2014       0.1
2       NH  2013       0.5
3       NH  2014       0.3
4       ZH  2014       0.5

In [25]:
change = pd.DataFrame(data, columns=["Year", "Province" ,"Literacy"])
change

   Year Province  Literacy
0  2013       FL       0.2
1  2014       FL       0.1
2  2013       NH       0.5
3  2014       NH       0.3
4  2014       ZH       0.5

In [26]:
change['nonsense']=change.Year / change.Literacy
change

   Year Province  Literacy      nonsense
0  2013       FL       0.2  10065.000000
1  2014       FL       0.1  20140.000000
2  2013       NH       0.5   4026.000000
3  2014       NH       0.3   6713.333333
4  2014       ZH       0.5   4028.000000

In [27]:
change['multiplied']=change.Literacy * change.nonsense
change

   Year Province  Literacy      nonsense  multiplied
0  2013       FL       0.2  10065.000000      2013.0
1  2014       FL       0.1  20140.000000      2014.0
2  2013       NH       0.5   4026.000000      2013.0
3  2014       NH       0.3   6713.333333      2014.0
4  2014       ZH       0.5   4028.000000      2014.0

In [28]:
change['Serie_aligned'] = pd.Series(range(5), index=[0,1,2, 3, 4])
change

   Year Province  Literacy      nonsense  multiplied  Serie_aligned
0  2013       FL       0.2  10065.000000      2013.0              0
1  2014       FL       0.1  20140.000000      2014.0              1
2  2013       NH       0.5   4026.000000      2013.0              2
3  2014       NH       0.3   6713.333333      2014.0              3
4  2014       ZH       0.5   4028.000000      2014.0              4

In [29]:
change['Serie_aligned'] = pd.Series(range(5,10), index=[0,1,2, 3, 4])
change

   Year Province  Literacy      nonsense  multiplied  Serie_aligned
0  2013       FL       0.2  10065.000000      2013.0              5
1  2014       FL       0.1  20140.000000      2014.0              6
2  2013       NH       0.5   4026.000000      2013.0              7
3  2014       NH       0.3   6713.333333      2014.0              8
4  2014       ZH       0.5   4028.000000      2014.0              9

In [30]:
change.to_dict()

{'Year': {0: 2013, 1: 2014, 2: 2013, 3: 2014, 4: 2014},
 'Province': {0: 'FL', 1: 'FL', 2: 'NH', 3: 'NH', 4: 'ZH'},
 'Literacy': {0: 0.2, 1: 0.1, 2: 0.5, 3: 0.3, 4: 0.5},
 'nonsense': {0: 10065.0,
  1: 20140.0,
  2: 4026.0,
  3: 6713.333333333334,
  4: 4028.0},
 'multiplied': {0: 2013.0, 1: 2014.0, 2: 2013.0, 3: 2014.0, 4: 2014.0},
 'Serie_aligned': {0: 5, 1: 6, 2: 7, 3: 8, 4: 9}}

In [31]:
pd.DataFrame(change.to_dict())

   Year Province  Literacy      nonsense  multiplied  Serie_aligned
0  2013       FL       0.2  10065.000000      2013.0              5
1  2014       FL       0.1  20140.000000      2014.0              6
2  2013       NH       0.5   4026.000000      2013.0              7
3  2014       NH       0.3   6713.333333      2014.0              8
4  2014       ZH       0.5   4028.000000      2014.0              9

In [32]:
data = [{'a': i, 'b':10* i}for i in range(6)]
print(data)

[{'a': 0, 'b': 0}, {'a': 1, 'b': 10}, {'a': 2, 'b': 20}, {'a': 3, 'b': 30}, {'a': 4, 'b': 40}, {'a': 5, 'b': 50}]

In [33]:
pd.DataFrame(data)

   a   b
0  0   0
1  1  10
2  2  20
3  3  30
4  4  40
5  5  50

In [34]:
import numpy as np
import pandas as pd

In [35]:
pd.DataFrame([{'aa': 1, 'bb': 2}, {'bb': 3, 'cc': 6}])

    aa  bb   cc
0  1.0   2  NaN
1  NaN   3  6.0

In [36]:
change=change.to_dict
change

<bound method DataFrame.to_dict of    Year Province  Literacy      nonsense  multiplied  Serie_aligned
0  2013       FL       0.2  10065.000000      2013.0              5
1  2014       FL       0.1  20140.000000      2014.0              6
2  2013       NH       0.5   4026.000000      2013.0              7
3  2014       NH       0.3   6713.333333      2014.0              8
4  2014       ZH       0.5   4028.000000      2014.0              9>

In [37]:
change=pd.DataFrame([{'aa':1,'bb':2},{'bb':3,'cc':6}])

In [38]:
change=change.to_dict()
change

{'aa': {0: 1.0, 1: nan}, 'bb': {0: 2, 1: 3}, 'cc': {0: nan, 1: 6.0}}

In [39]:
pd.DataFrame(np.random.randint(2, 12),
             columns=['foo', 'bar'],
             index=['a', 'b', 'c'])

   foo  bar
a    8    8
b    8    8
c    8    8

In [40]:
pd.DataFrame(np.random.randint(2, 12),
             columns=['foo', 'bar'],
             index=['a', 'b', 'c'])

   foo  bar
a    3    3
b    3    3
c    3    3

In [41]:
pd.DataFrame(np.random.randint(40, 52),
             columns=['foo', 'bar'],
             index=['a', 'b', 'c'])

   foo  bar
a   44   44
b   44   44
c   44   44

In [42]:
pd.DataFrame(np.random.randint(4, 100),
             columns=['first', 'second'],
             index=['a', 'b', 'c'])

   first  second
a     19      19
b     19      19
c     19      19

In [43]:
ind=pd.Index([2,3,56,67,23,45,43])

In [44]:
ind[1]

3

In [45]:
ind[::]

Int64Index([2, 3, 56, 67, 23, 45, 43], dtype='int64')

In [46]:
ind[2]

56

In [47]:
ind[-1]

43

In [48]:
ind[1:7:2]

Int64Index([3, 67, 45], dtype='int64')

In [49]:
ind[2:4]

Int64Index([56, 67], dtype='int64')

In [50]:
print(ind.size,ind.shape,ind.ndim,ind.dtype)

7 (7,) 1 int64

In [51]:
ind[2]=0

TypeError: Index does not support mutable operations

In [52]:
rng = np.random.RandomState(15)
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    8
1    5
2    5
3    7
dtype: int32

In [53]:
pas = np.random.RandomState(15)
ser = pd.Series(pas.randint(0, 10, 4))
ser

0    8
1    5
2    5
3    7
dtype: int32

In [54]:
pas = np.random.RandomState(10)
xz = pd.Series(pas.randint(0, 10, 4))
xz

0    9
1    4
2    0
3    1
dtype: int32

In [55]:
rng = np.random.RandomState(15)
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    8
1    5
2    5
3    7
dtype: int32

In [56]:
pas = np.random.RandomState(9)
ser = pd.Series(pas.randint(0, 10, 4))
ser

0    5
1    6
2    8
3    6
dtype: int32

In [57]:
pas = np.random.RandomState(15)
ser = pd.Series(pas.randint(0, 10, 12))
ser

0     8
1     5
2     5
3     7
4     0
5     7
6     5
7     6
8     1
9     7
10    0
11    4
dtype: int32

In [58]:
dfr = pd.DataFrame(pas.randint(0, 10, (5, 4)),
                  columns=['A', 'B', 'C', 'D'])
dfr

   A  B  C  D
0  9  7  5  3
1  6  8  2  1
2  1  0  5  2
3  2  1  8  5
4  6  9  2  8

In [59]:
dfr = pd.DataFrame(pas.randint(0, 10, (4,4)),
                  columns=['A', 'B', 'C', 'D'])
dfr

   A  B  C  D
0  6  8  8  3
1  4  7  2  0
2  5  7  3  8
3  5  3  1  0

In [60]:
np.exp(ser)

0     2980.957987
1      148.413159
2      148.413159
3     1096.633158
4        1.000000
5     1096.633158
6      148.413159
7      403.428793
8        2.718282
9     1096.633158
10       1.000000
11      54.598150
dtype: float64

In [61]:
np.sin(dfr*np.pi/4)

              A             B             C             D
0 -1.000000e+00 -2.449294e-16 -2.449294e-16  7.071068e-01
1  1.224647e-16 -7.071068e-01  1.000000e+00  0.000000e+00
2 -7.071068e-01 -7.071068e-01  7.071068e-01 -2.449294e-16
3 -7.071068e-01  7.071068e-01  7.071068e-01  0.000000e+00

In [62]:
dfr = pd.DataFrame(pas.randint(0, 10, (5, 4)),
                  columns=['A', 'B', 'C', 'D'])
dfr

   A  B  C  D
0  8  7  5  8
1  1  2  8  3
2  1  3  7  2
3  7  2  0  0
4  7  6  4  4

In [63]:
np.sin(dfr*np.pi/4)

              A         B             C             D
0 -2.449294e-16 -0.707107 -7.071068e-01 -2.449294e-16
1  7.071068e-01  1.000000 -2.449294e-16  7.071068e-01
2  7.071068e-01  0.707107 -7.071068e-01  1.000000e+00
3 -7.071068e-01  1.000000  0.000000e+00  0.000000e+00
4 -7.071068e-01 -1.000000  1.224647e-16  1.224647e-16

In [64]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                  'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
                        'New York': 19651127}, name='population')
print(area)
population

Alaska        1723337
Texas          695662
California     423967
Name: area, dtype: int64

California    38332521
Texas         26448193
New York      19651127
Name: population, dtype: int64

In [65]:
Cities = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                  'California': 423967}, name='Cities')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
                        'New York': 19651127}, name='population')
print(Cities)
population

Alaska        1723337
Texas          695662
California     423967
Name: Cities, dtype: int64

California    38332521
Texas         26448193
New York      19651127
Name: population, dtype: int64

In [66]:
population/Cities

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [67]:
Cities.index|population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [68]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
print(A)
print(B)
B
A + B

0    2
1    4
2    6
dtype: int64
1    1
2    3
3    5
dtype: int64

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [69]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
print(A)
print(B)
B
A - B

0    2
1    4
2    6
dtype: int64
1    1
2    3
3    5
dtype: int64

0    NaN
1    3.0
2    3.0
3    NaN
dtype: float64

In [70]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
print(A)
print(B)
B
A * B

0    2
1    4
2    6
dtype: int64
1    1
2    3
3    5
dtype: int64

0     NaN
1     4.0
2    18.0
3     NaN
dtype: float64

In [71]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
print(A)
print(B)
B
A + B * A

0    2
1    4
2    6
dtype: int64
1    1
2    3
3    5
dtype: int64

0     NaN
1     8.0
2    24.0
3     NaN
dtype: float64

In [72]:
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [73]:
data = {"Province": ["FL", "FL", "NH", "NH", "ZH"],
        "Year": [2013, 2014, 2013, 2014, 2014],
        "Literacy": [0.2, 0.1, 0.5, 0.3, 0.5]}
print(data)
data = pd.DataFrame(data)
data

{'Province': ['FL', 'FL', 'NH', 'NH', 'ZH'], 'Year': [2013, 2014, 2013, 2014, 2014], 'Literacy': [0.2, 0.1, 0.5, 0.3, 0.5]}

  Province  Year  Literacy
0       FL  2013       0.2
1       FL  2014       0.1
2       NH  2013       0.5
3       NH  2014       0.3
4       ZH  2014       0.5

In [74]:
change = pd.DataFrame(data, columns=["Year", "Province" ,"Literacy"])
change

   Year Province  Literacy
0  2013       FL       0.2
1  2014       FL       0.1
2  2013       NH       0.5
3  2014       NH       0.3
4  2014       ZH       0.5

In [75]:
change['nonsense']=change.Year / change.Literacy
change

   Year Province  Literacy      nonsense
0  2013       FL       0.2  10065.000000
1  2014       FL       0.1  20140.000000
2  2013       NH       0.5   4026.000000
3  2014       NH       0.3   6713.333333
4  2014       ZH       0.5   4028.000000

In [76]:
change['Serie_aligned'] = pd.Series(range(5), index=[0,1,2, 3, 4])
change

   Year Province  Literacy      nonsense  Serie_aligned
0  2013       FL       0.2  10065.000000              0
1  2014       FL       0.1  20140.000000              1
2  2013       NH       0.5   4026.000000              2
3  2014       NH       0.3   6713.333333              3
4  2014       ZH       0.5   4028.000000              4

In [77]:
change

   Year Province  Literacy      nonsense  Serie_aligned
0  2013       FL       0.2  10065.000000              0
1  2014       FL       0.1  20140.000000              1
2  2013       NH       0.5   4026.000000              2
3  2014       NH       0.3   6713.333333              3
4  2014       ZH       0.5   4028.000000              4

In [78]:
df2 = pd.DataFrame({"Province": ["FL", "NH", "ZH"], "Population": ["100000", "200000", "300000"]})
df2

  Province Population
0       FL     100000
1       NH     200000
2       ZH     300000

In [79]:
change.merge(df2)

   Year Province  Literacy      nonsense  Serie_aligned Population
0  2013       FL       0.2  10065.000000              0     100000
1  2014       FL       0.1  20140.000000              1     100000
2  2013       NH       0.5   4026.000000              2     200000
3  2014       NH       0.3   6713.333333              3     200000
4  2014       ZH       0.5   4028.000000              4     300000

In [80]:
df3 = pd.DataFrame({"province": ["FL", "NH"], "Population": ["100000", "200000"]})
df3
change.merge(df3, right_on='province', left_on='Province')

   Year Province  Literacy      nonsense  Serie_aligned province Population
0  2013       FL       0.2  10065.000000              0       FL     100000
1  2014       FL       0.1  20140.000000              1       FL     100000
2  2013       NH       0.5   4026.000000              2       NH     200000
3  2014       NH       0.3   6713.333333              3       NH     200000

In [81]:
df4 = pd.DataFrame({"Province": ["FL", "NH", "UT"], "Population": ["100000", "200000", "50000"]})
change.merge(df4, how='outer')

     Year Province  Literacy      nonsense  Serie_aligned Population
0  2013.0       FL       0.2  10065.000000            0.0     100000
1  2014.0       FL       0.1  20140.000000            1.0     100000
2  2013.0       NH       0.5   4026.000000            2.0     200000
3  2014.0       NH       0.3   6713.333333            3.0     200000
4  2014.0       ZH       0.5   4028.000000            4.0        NaN
5     NaN       UT       NaN           NaN            NaN      50000

In [82]:
df5 = pd.DataFrame({"Province": ["FL", "NH", "FL"], "Population": ["100000", "200000", "50000"]})
print(change)
change.merge(df5, how='outer')

   Year Province  Literacy      nonsense  Serie_aligned
0  2013       FL       0.2  10065.000000              0
1  2014       FL       0.1  20140.000000              1
2  2013       NH       0.5   4026.000000              2
3  2014       NH       0.3   6713.333333              3
4  2014       ZH       0.5   4028.000000              4

   Year Province  Literacy      nonsense  Serie_aligned Population
0  2013       FL       0.2  10065.000000              0     100000
1  2013       FL       0.2  10065.000000              0      50000
2  2014       FL       0.1  20140.000000              1     100000
3  2014       FL       0.1  20140.000000              1      50000
4  2013       NH       0.5   4026.000000              2     200000
5  2014       NH       0.3   6713.333333              3     200000
6  2014       ZH       0.5   4028.000000              4        NaN

In [83]:
serie_a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],
                     index=['f', 'e', 'd', 'c', 'b', 'a'])
serie_b = pd.Series(np.arange(len(serie_a), dtype=np.float64),
                 index=['f', 'e', 'd', 'c', 'b', 'a'])

In [84]:
serie_a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [85]:
serie_b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [86]:
pd.Series(np.where(pd.isnull(serie_a),serie_b,serie_a),index=serie_a.index)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64

In [87]:
serie_a.combine_first(serie_b)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64

In [88]:
Name_of_students = pd.Series([np.nan, "Prathik", "Chetan", np.nan, "Sachin", np.nan],index=[1, 23, 45, 66, 8, 78])

In [89]:
Name_of_students

1         NaN
23    Prathik
45     Chetan
66        NaN
8      Sachin
78        NaN
dtype: object

In [90]:
Name_of_students2 = pd.Series(["Santosh", np.nan, np.nan, "Sangu", np.nan, "Abdul"],index=[1, 23, 45, 66, 8, 78])

In [91]:
Name_of_students2

1     Santosh
23        NaN
45        NaN
66      Sangu
8         NaN
78      Abdul
dtype: object

In [92]:
pd.Series(np.where(pd.isnull(Name_of_students2),Name_of_students,Name_of_students2),index=Name_of_students2.index)

1     Santosh
23    Prathik
45     Chetan
66      Sangu
8      Sachin
78      Abdul
dtype: object